def ver1():
    """1.Написать функцию, которая принимает список целых чисел и возвращает True,
    если в списке отсутствуют нули, в противном случае возвращает False."""

def ver2():
    """2.Написать функцию, которая создает массивы из десяти
    нулей, единиц и пятерок. """

def ver3():
    """3.Написать функцию, которая создает массив из всех четных элементов между 50 и 90. """

def ver4():
    """4.Написать функцию, которая принимает два вектора и
    возвращает их внешнее произведение. """

def ver5():
    """5.Написать функцию, которая принимает вектор или матрицу и возвращает их норму."""

def ver6():
    """6.Написать функцию, которая принимает матрицу и возвращает её определитель."""

def ver7():
    """7.Написать функцию, которая принимает матрицу и возвращает сумму элементов её главной диагонали."""

def ver8():
    """8.Написать функцию, которая генерирует шесть случайных
    чисел между 30 и 100. """

def ver9():
    """9.Написать функцию, которая генерирует матрицу 5×5 и
    заполняет её случайными значениями и возвращает
    минимальное и максимальное значения полученной матрицы."""

def ver10():
    """10. Написать функцию, которая принимает список целых
    чисел и возвращает список с перемешанными числами."""

def ver11():
    """11. Написать функцию, которая строит гистограмму популярных
    языков программирования. Данные можно взять из последних данных TIOBI."""

def ver12():
    """12. Написать функцию, которая читает таблицу из файла
    .csv, содержащую шапку и процентную долю каждого столбца
    и строит по ней круговую диаграмму. """

def ver13():
    """13. Написать функцию, которая создает случайную
     точечную диаграмму со случайным размером шариков. """

def ver14():
    """14. Написать функцию, которая строит точечную диаграмму
    повышения уровня моря за последние 100 лет."""
