import random
def ver_1(num: int) -> list[int]:
    return []
    """ Написать функцию, которая принимает целое число и с 
    помощью генераторного выражения создает и возвращает новый список
    случайных чисел с длиной входящего числа. 
    """

def ver_2():
    pass
    """Написать функцию, которая принимает три целых числа x, a, b и 
    с помощью генераторного выражения создает и возвращает 
    новый список длинной x случайных чисел от a до b. 
    Для решения данного задания рекомендуется использовать 
    функцию random.randint()."""


"""Написать функцию, которая принимает целочисленный 
список, состоящий из n элементов, и с помощью генераторного 
выражения создает и возвращает список, элементами которого 
являются удвоенные элементы входящего списка."""

"""Написать функцию, которая принимает целочисленный 
список, состоящий из n элементов, и с помощью генераторного 
выражения создает и возвращает список, содержащий только 
четные элементы входящего списка."""

"""Написать функцию, которая принимает целочисленный 
список, состоящий из n элементов, и с помощью генераторного 
выражения создает и возвращает список, содержащий только 
положительный элементы входящего списка."""

"""Написать функцию, которая принимает словарь и с помощью 
генераторного выражения создает и возвращает новый 
список, содержащий значения ключей входящего словаря. """

"""Написать функцию, которая принимает два одинаковых по длине
 списка и с помощью генераторного выражения 
создает и возвращает новый словарь, в котором ключами 
являются элементы первого списка, а значениями ключей – элементы второго."""

"""Написать функцию, которая принимает список и с 
помощью генераторного выражения создает и возвращает 
словарь, где в качестве ключей будут номера позиций элементов 
входящего словаря, а значениями – сами элементы."""

"""Написать функцию, которая принимает целочисленный 
список, состоящий из n элементов, и с помощью генераторного 
выражения создает новый массив элементов из тех элементов 
входящего массива, квадрат числа которых не превышает 30."""

"""Написать функцию, которая принимает список, состоящий из n элементов,
и целое число x и с помощью генераторной функции выводит на консоль
только те элементы входящего списка, которые больше числа x."""

"""Написать функцию, которая принимает список, состоящий из n элементов,
и два целых числа a и b и с помощью генераторной 
функции выводит на консоль элементы входящего 
списка от a до b включительно. Требуется предусмотреть
 ситуацию, когда значения a или b больше длины списка."""

"""Написать функцию, которая принимает список списков 
и с помощью генераторного выражения создает и возвращает 
новый список, который содержит все элементы входящих 
списков."""

"""Написать функцию, которая принимает список и с 
помощью генераторного выражения создает и возвращает новый 
список, содержащий только уникальные элементы входящего 
списка."""

"""Написать функцию, которая принимает список словарей и с помощью
генераторного выражения создает и возвращает новый словарь, который 
содержит все элементы входящих словарей. Ключи в словарях уникальны."""

"""Написать функцию, которая принимает строку и с помощью
генераторного выражения создает список, в котором 
все символы входящей строки смещены на один символ вправо 
по алфавиту, кроме символов от «ы» до «я». Требуется вернуть 
строку из созданного списка."""
