def ver1():
    """1. Написать функцию, которая принимает путь к
    директории и создает новую директорию по тому же пути с именем
    thumbnail, в которую записывает иконки изображений,
    находящихся в принятой функцией директории."""

def ver2():
    """2. Написать функцию, которая принимает путь к изображению
    и конвертирует его в формат .ICO, сохраняя её по тому
    же пути, что и исходное изображение."""

def ver3():
    """3. Написать функцию, которая принимает путь к изображению
    и выполняет над ней autocontrast, сохраняя новое изображение по тому же пути."""

def ver4():
    """4. Написать функцию, которая принимает путь к изображению
    и создает отраженное изображение, сохраняя его по тому же пути."""

def ver5():
    """5. Написать функцию, которая принимает текст и стиль
    шрифта в виде строки и создает изображение с полученным
    текстом и шрифтом."""

def ver6():
    """6. Написать функцию, которая принимает путь
    к изображению и поворачивает его на 90 градусов, сохраняя его по тому же пути."""

def ver7():
    """7. Написать функцию, которая принимает путь к директории
    с изображениями и список расширений (.png, .jpg, .ico и
    т.д.) и создает директории по полученному пути с наименованием расширения,
    в которые записывает конвертированные исходные изображения по полученным форматам. """

def ver8():
    """8. Написать функцию, которая принимает путь к tar архиву
    и путь для сохранения и распаковывает из него все изображения, сохраняя их по указанному пути."""

def ver9():
    """9. Написать функцию, которая принимает путь к изображению
    и список пикселей и заменяет полученные пиксели прозрачным цветом,
    сохраняя изображение в той же директории."""

def ver10():
    """10. Написать функцию, которая принимает путь к изображению,
    искомый цвет пикселя и цвет, на который требуется его
    заменить, и заменяет полученный цвет на картинке цветом замены,
    сохраняя новое изображение в той же директории."""

def ver11():
    """11. Написать класс, который содержит функцию, принимающую путь к gif
    изображению и делает его раскадровку, сохраняя изображения по тому же пути,
    что и gif. Вторая функция будет принимать директорию с изображениями и записывать их в gif."""

def ver12():
    """12. Написать класс, который содержит функцию, выполняющую скриншот экрана
    и функцию, которая сохраняет изображение, находящееся в буфере, если такое существует."""

def ver13():
    """13. Написать функцию, которая принимает путь к файлу с
    изображением и два списка координат пикселей и выполняет
    перемещение пикселей двух списков."""

def ver14():
    """14. Написать функцию, которая принимает путь к
    изображениям и склеивает их в одно изображение."""
