def ver1():
    """1. Написать GUI приложение, которое имеет текстовое
    поле и кнопку для сохранения текста, при нажатии на которую
    открывается модальное окно указания пути для сохранения
    текстового файла. """

def ver2():
    """2. Написать GUI приложение, которые позволяет просматривать PDF файлы."""

def ver3():
    """3. Написать GUI приложение, которое имеет кнопку
    «Сделать скриншот», по нажатию на которую создается
    скриншот экрана и вставляет в окно приложение и появляются
    возможности настройки яркости изображения, некоторые
    фильтры и поворот изображения. По нажатию на кнопку
    «Сохранять» должно сохраняться сконфигурированное изображение."""

def ver4():
    """4. Написать GUI приложение, которое представляет собой
    упрощенный файловый менеджер, с возможностью создания,
    удаления и переименования директорий и файлов."""

def ver5():
    """5. Написать GUI приложение, которое представляет собой
    галерею изображений с возможностью просмотра плитки изображений,
    каждого изображения по отдельности и добавления
    новых изображений в галерею."""

def ver6():
    """6. Написать GUI приложение, которое представляет собой
    библиотеку с поиском книг по автору и наименованию,
    добавлению новых книг и чтению книг в форматах epub, fb2 и pdf."""

def ver7():
    """7. Написать GUI приложение, которое позволяет рисовать
    в определенном поле с помощью курсора мыши. В приложении
    также можно выбрать цвет и толщину кисти."""

def ver8():
    """8. Написать GUI приложение, которое представляет собой
    несложный мессенджер, работающий с другим пользователем
    по IP адресу. """

def ver9():
    """9. Написать GUI приложение, которое представляет собой
    книгу заметок, позволяющую создавать новые заметки, редактировать
    и удалять существующие. Приложение позволяет создавать
    группы заметок и выполнять сортировку по дате."""

def ver10():
    """10. Написать GUI приложение для проверки регулярных
    выражений. В двух полях пользователю требуется ввести текст
    и регулярное выражение. В поле текста после применения
    регулярного выражения требуется выделить найденную часть,
    если регулярное выражение написано с ошибкой, необходимо
    уведомить об этом пользователя."""

def ver11():
    """11. Написать GUI приложение для работы с базой данных.
    Приложение позволяет выполнять соединение с БД, а также
    выполнять запросы и получать результаты ответов."""

def ver12():
    """12. Написать GUI приложение для игры «Крестикинолики»."""

def ver13():
    """13. Написать GUI приложение для игры «Сапер»."""
