def var1():
    """1. Написать функцию, которая принимает наименование
    таблицы, поля и его значение и возвращает идентификатор записи,
    в которой значение полученного поля соответствует переданному функции, или возвращает None."""


def var2():
    """2. Написать функцию, которая принимает наименование
    таблицы и выводит количество одинаковых значений в её полях
    и  наиболее часто повторяющееся значение полей."""


def var3():
    """3. Написать функцию, которая возвращает наименование
    всех таблиц связки, которые находятся в базе данных, если они
    существуют. Стоит отметить, что в данном задании предполагается,
    что таблицы связки именуются склеиванием имени двух
    таблиц через знак нижнего подчеркивания «_»."""


def var4():
    """4. Написать функцию, которая принимает наименование
    таблицы и список списков, которые содержат данные,
    и обновляет данные полученной таблицы на указанные во внутренних
    списках, где в качестве идентификаторов записей следует принимать номер
    внутреннего списка плюс единица, т.к. идентификаторы записей СУБД нумеруются с единицы."""


def var5():
    """5. Написать функцию, которая принимает словарь,
    в котором ключами являются наименования таблиц, а значениями
    список списков, содержащих данные для таблицы, и выполняет
    вставку полученных данных в указанные таблицы."""


def var6():
    """6. Написать функцию, которая принимает наименование
    таблицы, имя поля и возвращает все записи по полученному
    полю из указанной таблицы."""


def var7():
    """7. Написать функцию, которая переводит структуру всех
    таблиц существующей базы данных, в формат Json."""


def var8():
    """8. Написать функцию, которая принимает путь к файлу
    Json, который содержит описание таблиц и их полей, и создает
    новые таблицы, указанные в полученном файле."""


def var9():
    """9. Написать функцию, которая принимает путь к файлу с
    расширением .txt, который содержит данные для заполнения
    таблицы, и по указанным в файле данным создает таблицу или
    таблицы и заполняет их данными."""


def var10():
    """10. Написать функцию, которая строит ER модель базы
    данных. Можно сгенерировать схему в формате HTML или
    XML, либо воспользоваться сторонними приложениями и библиотеками"""
